In [1]:
%load_ext autoreload

In [2]:
%autoreload 1
import pandas as pd
import datetime as dt
from graph_tool.all import *
%aimport gtfs_parser
#import gtfs_parser
%aimport timetable
#import timetable

In [3]:
gtfs_path = 'GTFS'

In [4]:
parser = gtfs_parser.gtfs_parser(gtfs_path)

In [5]:
date, service_ids = parser.get_busiest_date()

In [6]:
service_ids

frozenset({'105801',
           '105812',
           '205801',
           '62001',
           '62003',
           '62004',
           '62005',
           '62011',
           '62012',
           '62018',
           '62022',
           '62026'})

In [7]:
feed = parser.get_feed(service_ids)

In [14]:
feed.trips.head()

,route_id,service_id,trip_id,direction_id,block_id,shape_id,direction,wheelchair_accessible,schd_trip_id
0,1,62001,6201786711020,1,620208526402,6208085,North,1,1786711020
1,1,62001,6201786715020,0,620208526402,6206351,South,1,1786715020
2,1,62001,6201786717020,1,620208526402,6208084,North,1,1786717020
3,1,62001,6201786720020,1,620208526402,6208085,North,1,1786720020
4,1,62001,6201786721020,0,620208526402,6206351,South,1,1786721020

In [15]:
feed.stop_times.head()

,trip_id,arrival_time,departure_time,stop_id,stop_sequence,stop_headsign,pickup_type,shape_dist_traveled
0,58139647410,33450.0,33450.0,30384,21,Linden,0,78138
1,58139647410,33570.0,33570.0,30132,22,Linden,0,79491
2,58139647410,33690.0,33690.0,30166,23,Linden,0,81012
3,58139647410,33750.0,33750.0,30031,24,Linden,0,81972
4,58139647410,33840.0,33840.0,30007,25,Linden,0,83150

In [16]:
feed.stops.head()

,stop_id,stop_code,stop_name,stop_desc,location_type,parent_station,wheelchair_boarding,geometry
0,1,1,Jackson & Austin Terminal,"Jackson & Austin Terminal, Northeastbound, Bus...",0,NaN,1,POINT (-87.77410482000001 41.87632184)
1,2,2,5900 W Jackson,"5900 W Jackson, Eastbound, Southside of the St...",0,NaN,1,POINT (-87.77131794 41.87706679)
2,3,3,Jackson & Menard,"Jackson & Menard, Eastbound, Southside of the ...",0,NaN,1,POINT (-87.76975039 41.87695725)
3,4,4,5700 W Jackson,"5700 W Jackson, Eastbound, Southside of the St...",0,NaN,1,POINT (-87.76745055000001 41.87702418)
4,6,6,Jackson & Lotus,"Jackson & Lotus, Eastbound, Southeast Corner",0,NaN,1,POINT (-87.76144599999999 41.876513)